SkydiverMCU/mcu-iap-demo/Cortex-M0/MM32F0120/MM32F0120_Bootloader/Device/MM32F0120/Include/reg_i2c.h
/**
  * @brief I2C_SLVMASK Register Bit Definition
  */
#define  I2C_SLVMASK_MASK_Pos                     (0)
#define  I2C_SLVMASK_MASK_Msk                     (0x3FFU << I2C_SLVMASK_MASK_Pos)                  /*!<Slave address mask*/
#define  I2C_SLVMASK_MASK                         I2C_SLVMASK_MASK_Msk
#define  I2C_SLVMASK_MASK_0                       (0x001U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_1                       (0x002U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_2                       (0x004U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_3                       (0x008U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_4                       (0x010U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_5                       (0x020U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_6                       (0x040U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_7                       (0x080U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_8                       (0x100U << I2C_SLVMASK_MASK_Pos) 
#define  I2C_SLVMASK_MASK_9                       (0x200U << I2C_SLVMASK_MASK_Pos) 

/**
  * @brief I2C_SLVRCVADDR Register Bit Definition
  */
#define  I2C_SLVRCVADDR_ADDR_Pos                  (0)
#define  I2C_SLVRCVADDR_ADDR_Msk                  (0x3FFU << I2C_SLVRCVADDR_ADDR_Pos)               /*!<Slave address actually received by I2C*/
#define  I2C_SLVRCVADDR_ADDR                      I2C_SLVRCVADDR_ADDR_Msk
#define  I2C_SLVRCVADDR_ADDR_0                    (0x001U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_1                    (0x002U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_2                    (0x004U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_3                    (0x008U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_4                    (0x010U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_5                    (0x020U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_6                    (0x040U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_7                    (0x080U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_8                    (0x100U << I2C_SLVRCVADDR_ADDR_Pos) 
#define  I2C_SLVRCVADDR_ADDR_9                    (0x200U << I2C_SLVRCVADDR_ADDR_Pos) 


#endif

